# #### 2.2[12]: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. 
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать.
# Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. 
# Помогите Кате отгадать задуманные Петей числа.

#     Примеры/Тесты:
#     4 4 -> 2 2
#     5 6 -> 2 3

# **Примечание.**
# Здесь нужно составить два уравнения. Которые приведут к квадратному уравнению.
# Кто не помнит, как решать квадратное уравнение - посмотрите в сети. Обойдите дополнительной проверкой возможность 
# комплексных решений. Можно игнорировать то, что получаться рациональные решения вместо натуральных.

# Для вычисления квадратного корня используйте возведение в степень 0.5 или  ```(*)``` **Усложнение.** найдите 
# самостоятельно в сети какая функция стандартной библиотеки вычисляет квадратный корень и как до нее добраться.


numbers = input(f'Петя называет сумму и произведение этих чисел через пробел: ').split()
print(numbers)
numbers = [int(number) for number in numbers]
S, P = numbers

a = 1
b = -S
c = P

D = pow(b, 2) - 4 * a * c

if D == 0:
    x = (-b + pow(D, .5)) / 2 * a 
    y = (-b - pow(D, .5)) / 2 * a 

    # print(f'{D} = {pow(b, 2)} - {4 * a * c}')
    # print(f'{x} = ({-b} + {pow(D, .5)}) / {2 * a} ')
    # print(f'{y} = ({-b} - {pow(D, .5)}) / {2 * a} ')

    print(int(x), int(y))
else:
    print('корней нет')
